app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE (SupplierProductCode LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "companies" WHERE (Description LIKE '%makita%')
---
  def index
     @companies = Company.paginate(:page => params[:page], :per_page => 5).search(params[:search])

SELECT  "companies".* FROM "companies" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "companies"
---
  def show
      # added some condition for where clause
      @companies = Company.paginate(:page => params[:page], :per_page => 5)