app/controllers/compares_controller.rb

  def index
    @compares = Compare.paginate(:page => params[:page], :per_page => 8).search(params[:search])
---
SELECT  "compares".* FROM "compares" WHERE (manufacturer_code LIKE '%GA4530RKD%') LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "compares" WHERE (manufacturer_code LIKE '%GA4530RKD%')