app/models/company.rb

INSERT INTO "companies" ("GPHProductCode", "SupplierProductCode", "BarCode", "Description", "GPH_RRP", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
   def self.import(file)
    if file.nil?
      puts "No file selected"
      return false
    else
      CSV.foreach(file.path, :headers =>true) do |row |
        puts row.inspect #just so that we know the file's being read
          #create new model instances with the data
        Company.create!(
          GPHProductCode: row[0],
          SupplierProductCode: row[1],
          BarCode: row[2].to_i,
          Description: row[3],
          GPH_RRP: row[4].to_d
        )